In [1]:
# Import all the needed libraries
import configparser, pandas as pd, os, openai
from sqlalchemy import create_engine

# Set the API key and load the configuration file
config = configparser.ConfigParser()
config.read('../config.ini')
openai.api_key = config['openai']['api_key']
os.environ['OPENAI_API_KEY'] = config['openai']['api_key']

# SQL - Natural Language
## Introduction
In this notebook we will demonstrate the ability to turn natural language into SQL queries. We will use GPT-3 to generate SQL queries from natural language. We will then use the generated SQL queries to query the database and return the results. Implementing this in a real world application can help users to query data without having to know SQL. This same principle can be applied to other database types such as NoSQL databases.

## Step 1: Load the database files and create the demo table
We will use sqlalchemy to create a database object and then create a table in the database. We will use pandas to read the data and upload it to the database.
The follwing files can be used to create the database and table:
- ../data_files/TA_POP_FEMALE_2022.xlsx
- ../data_files/TA_POP_MALE_2022.xlsx

We should combine both files into a single DataFrame and then upload it to the database.


|       |   nis_code | city                   | frist_name   |   frequency | sex   |
|------:|-----------:|:-----------------------|:-------------|------------:|:------|
| 95698 |      37011 | Pittem                 | Ronny        |          11 | M     |
| 37001 |      21004 | Brussel                | Marie-Claude |           9 | F     |
| 50566 |      21018 | Sint-Lambrechts-Woluwe | Daniela      |          42 | F     |
| 61000 |      24009 | Bertem                 | Yannick      |           9 | M     |
| 63880 |      24045 | Huldenberg             | Rik          |           6 | M     |

In [2]:
# Connect to a Postgres database on localhost
engine = create_engine('postgresql://postgres:postgres@localhost:5432/postgres')
connection = engine.connect()

In [6]:
# Upload the data to the database
males  = pd.read_excel('../data_files/TA_POP_MALE_2022.xlsx')
males['SEX'] = 'M'
females = pd.read_excel('../data_files/TA_POP_FEMALE_2022.xlsx')
females['SEX'] = 'F'

# Combine both databframes
all_names = pd.concat([males, females])
del(males, females)

# Rename the columns
all_names.drop(columns=['tx_descr_fr'], inplace=True)
all_names.columns = ['nis_code', 'city', 'first_name', 'frequency', 'sex']

In [7]:
# Upload the dataframe to a new table in Postgres
all_names.to_sql('names', con=engine, if_exists='replace', index=False)

# Show the table schema
pd.read_sql_query('SELECT * FROM names LIMIT 10', con=engine)

   nis_code        city first_name  frequency sex
0     11001  Aartselaar       Marc        117   M
1     11001  Aartselaar        Jan        113   M
2     11001  Aartselaar        Luc        106   M
3     11001  Aartselaar       Dirk        102   M
4     11001  Aartselaar       Paul         98   M
5     11001  Aartselaar    Patrick         82   M
6     11001  Aartselaar      Peter         78   M
7     11001  Aartselaar       Bart         72   M
8     11001  Aartselaar      Jozef         72   M
9     11001  Aartselaar        Tom         62   M

## Step 2: Create an OpenAI Completion object
In this step we will call the OpenAI API to create a Completion object. First, we will need to create a table definition:
```
Postgres SQL Table Definition:
name(NIS_CODE, CITY, FIRST_NAME, FREQUENCY, SEX)
```
We should then pass the table definition to the OpenAI Completion object, so that it can be used to generate SQL queries.

In [8]:
def generate_query(table_definition, prompt):
    '''
    Generate an SQL query based on a table definition and a prompt
    '''
    response = openai.Completion.create(
    model="code-davinci-002",
    prompt=f"{table_definition} \n\n Write me the following SQL query:{prompt}\nSELECT",
    temperature=0, # 0 means no randomness, 1 means completely random
    max_tokens=150, # The maximum number of tokens to generate
    top_p=1, # Control diversity via nucleus sampling
    frequency_penalty=0, # How much we penalize new tokens based on their existing frequency in the text so far
    presence_penalty=0, # How much we penalize new tokens based on whether they appear in the text so far
    stop=["#", ";"]
    )

    return "SELECT" + response.choices[0].text

In [14]:
# Now let's generate a query
table_definition = '''
Postgres SQL Table Definition:\n
names(nis_code, city, first_name, frequency, sex)
'''
prompt = "How many unique first names are there in the table?"

print(generate_query(table_definition, prompt))

SELECT COUNT(DISTINCT first_name) FROM names

In [17]:
# Now let's automaticly run the generated query
prompt = "What's the average amount of characters for a first name in the table?"
pd.read_sql_query(generate_query(table_definition, prompt), con=engine)

        avg
0  6.023404